{
   "Abilities": [
      {
         "Name": "Adaptability",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When using Moves that deal damage and are the same elemental Type as the Pokemon with Adaptability, gain an additional 2 STAB instead of 1."
      },
      {
         "Name": "Aftermath",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When the Pokemon is reduced to 0 HP or less, they create a 5-meter Burst. Everything in the Burst loses 1/4 of their full HP. Do not apply weakness or resistance. Do not apply stats."
      },
      {
         "Name": "Air Lock",
         "Activation": "Cast",
         "Limit": "Hourly",
         "Keyword": "Sustain",
         "Effect": "The weather is set to normal as long as the Pokemon with Air Lock wants it to remain that way."
      },
      {
         "Name": "Analytic",
         "Activation": "Cast",
         "Limit": "Hourly",
         "Keyword": "None",
         "Effect": "For the next 5 rounds, if the user's turn comes immediately after any of its target's, in the queue, the user may roll 2 extra STAB on damaging Moves ignoring the Type of Move used."
      },
      {
         "Name": "Anger Point",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When the Pokemon receives a Critical Hit, raise their Attack 6 Combat Stages."
      },
      {
         "Name": "Anticipation",
         "Activation": "Cast",
         "Limit": "Hourly",
         "Keyword": "None",
         "Effect": "During an encounter you may target a Pokemon. Roll 1d20; on roll, the target reveals if they have any Moves that are Super-Effective against the Pokemon with Anticipation; on 11 or better, the target reveals up to 3 moves that are Super-Effective against the Pokemon with Anticipation; on 16 or better, the target reveals up to 5 moves that are Super-Effective against the Pokemon with Anticipation and all of those Moves must roll +1 during Accuracy Check to hit the Pokemon with Anticipation."
      },
      {
         "Name": "Arena Trap",
         "Activation": "Cast",
         "Limit": "Daily",
         "Keyword": "None",
         "Effect": "A large wall of sand, 10-meters high surrounds the encounter. The diameter of the Arena Trap must be at least 10-meters but cannot be greater then 40-meters. There must be sufficient ground around to manipulate or the Ability cannot be used. The walls are constantly shifting making it impossible to climb. If a section of the wall is destroyed, it immediately restores itself. If the caster is felled or returned to a Poke Ball, the Arena Trap falls."
      },
      {
         "Name": "Bad Dreams",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "Anything sleeping within 30-meters of the Pokemon with Bad Dreams lose 1/8th of their full HP at the beginning of each round."
      },
      {
         "Name": "Battle Armor",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "Immune",
         "Effect": "Critical Hits"
      },
      {
         "Name": "Big Pecks",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "Immune",
         "Effect": "The user cannot have its Defense Stat lowered. The user cannot have its Defense Combat Stages lowered."
      },
      {
         "Name": "Blaze",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "Last Chance",
         "Effect": "Fire"
      },
      {
         "Name": "Chlorophyll",
         "Activation": "Trigger",
         "Limit": "Hourly",
         "Keyword": "None",
         "Effect": "While in Sunny Weather, the Speed stat of the Pokemon is doubled."
      },
      {
         "Name": "Clear Body",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The Pokemon's Combat Stages may not be lowered by the effect of Abilities or Moves. Status effects may still alter their Combat Stages."
      },
      {
         "Name": "Cloud Nine",
         "Activation": "Cast",
         "Limit": "Hourly",
         "Keyword": "None",
         "Effect": "Return the Weather of the field to Normal if the Pokemon with Cloud Nine is a higher level then the Pokemon who caused the weather effect."
      },
      {
         "Name": "Color Change",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "Whenever the Pokemon is hit by a damage-dealing Move, the Pokemon with Color Change will have its Type changed to the same Type as that of the Move it was damaged by."
      },
      {
         "Name": "Compound Eyes",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The user needs -3 to hit on any Accuracy Check."
      },
      {
         "Name": "Contrary",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "If something would raise the user's Combat Stages, it instead lowers the user's Combat Stages by the same amount. If something would lower the user's Combat Stages, it instead raises the user's Combat Stages by the same amount."
      },
      {
         "Name": "Cursed Body",
         "Activation": "Cast",
         "Limit": "Daily",
         "Keyword": "None",
         "Effect": "When a foe hits the Pokemon with Cursed Body with a melee Move, that Move becomes Disabled after damaged is dealt."
      },
      {
         "Name": "Cute Charm",
         "Activation": "Trigger",
         "Limit": "Daily",
         "Keyword": "None",
         "Effect": "When an opposite gendered foe attacks the Pokemon with Cute Charm, they become Infatuated after damaged is dealt."
      },
      {
         "Name": "Damp",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The Moves Selfdestruct and Explosion may not be used when a Pokemon with Damp is within 20-meters of Selfdestruct or Explosion's user. The Ability Aftermath may not be activated when a Pokemon with Damp is within 20-meters of the Pokemon attempting to activate Aftermath."
      },
      {
         "Name": "Dark Art",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "Last Chance",
         "Effect": "Dark"
      },
      {
         "Name": "Defeatist",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When below 50% HP, this Pokemon's Attack and Special Attack is set at -3 Combat Stages. It cannot be raised or lowered unless the user recovers HP above 50% HP."
      },
      {
         "Name": "Defiant",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "Whenever the user has a Combat Stage lowered, by something other than its own Moves or Abilities, the user's Attack is raised 2 Combat Stages for each Combat Stage it was lowered."
      },
      {
         "Name": "Download",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When the Pokemon with Download targets with a damage-dealing Move, the target must reveal which of its defenses are lower. When the Pokemon with Download attacks a foe, they are treated as if their Attack is raised 1 Combat Stage if the target's Defense is lower then the target's Special Defense. When the Pokemon with Download attacks a foe, they are treated as if their Special Attack is raised 1 Combat Stage if the target's Special Defense is lower then the target's Defense."
      },
      {
         "Name": "Drizzle",
         "Activation": "Cast",
         "Limit": "Hourly",
         "Keyword": "Sustain, Weather",
         "Effect": "As a Free Action, the Pokemon uses the Move Rain Dance. The Rain does not go away like normal Rain; instead to Sustain, the Pokemon must remain out of a Poke Ball and must be above 0 HP. The Raining effect can be replaced by other major Weather conditions."
      },
      {
         "Name": "Drought",
         "Activation": "Cast",
         "Limit": "Hourly",
         "Keyword": "Sustain, Weather",
         "Effect": "As a Free Action, the Pokemon uses the Move Sunny day. The Sun does not go away like normal Sun; instead to Sustain, the Pokemon must remain out of a Poke Ball and must be above 0 HP. The Sunny effect can be replaced by other major Weather conditions."
      },
      {
         "Name": "Dry Skin",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "While in Sunny Weather, the user loses 1/8 of its full HP at the beginning of each round. While in Rainy Weather, the user gains 1/8 of its full HP at the beginning of each round. Fire Type Moves made towards the Pokemon with Dry Skin deal damage as if the offender is 1 Combat Stage higher in whichever Attack Stat the Move consults. Water Type Moves heal the Pokemon with Dry Skin by calculating damage as if Dry Skin's user is resistant to Water Moves then healing that much HP instead of dealing damage."
      },
      {
         "Name": "Early Bird",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When making Sleep Checks, the Sleep Check counter starts at 11."
      },
      {
         "Name": "Effect Spore",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When hit by a melee Move, roll 1d20; on a result of 15-16, the attacker is Poisoned; on a result of 17-18, the attacker is Paralyzed; on a result of 19- 20, the attacker falls Asleep."
      },
      {
         "Name": "Filter",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When the user is hit by a Super- Effective attack, the attack deals 1.5x damage instead of x2 damage. If the user is hit by a Super-Super-Effective attack, the attack deals x3 damage instead of x4 damage."
      },
      {
         "Name": "Flame Body",
         "Activation": "Trigger",
         "Limit": "Daily",
         "Keyword": "None",
         "Effect": "When a foe hits the Pokemon with Flame Body with a melee Move, they become Burned after damaged is dealt."
      },
      {
         "Name": "Flare Boost",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When Burned, the user's Special Attack is raised by 2 Combat Stages. If the user is cured of its Burn, its Special Attack is lowered by 2 Combat Stages."
      },
      {
         "Name": "Flash Fire",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The user does not take damage from Fire Type Moves and may not be Frozen. If the user is hit by a Fire Type Move, the user adds 1 bonus STAB to the next Fire Type Move they use in the encounter."
      },
      {
         "Name": "Flower Gift",
         "Activation": "Trigger",
         "Limit": "Hourly",
         "Keyword": "Burst",
         "Effect": "If it is Sunny, Flower Gift creates a 4-meter Burst. The user and all of their allies in Sunny Weather have their Attack raised 2 Combat Stages and have their Special Defense raised 2 Combat Stages."
      },
      {
         "Name": "Focus",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "Last Chance",
         "Effect": "Fighting"
      },
      {
         "Name": "Forecast",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The user's Type changes depending on the Weather the Pokemon is in. It changes to Fire Type if it is Sunny, Ice Type if it is Hailing, Water Type if it is Rainy. It returns to Normal Type if it is any other condition. If there are multiple Weather Effects on the field, choose one type for the user to be that corresponds with an existing Weather Effect."
      },
      {
         "Name": "Forewarn",
         "Activation": "Cast",
         "Limit": "Hourly",
         "Keyword": "None",
         "Effect": "The Move with the highest Damage Dice Roll known by the targeted foe is revealed. If there is a tie, all tied Moves are revealed. The Moves revealed must roll +2 to hit during Accuracy Checks."
      },
      {
         "Name": "Freezing Point",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "Last Chance",
         "Effect": "Ice"
      },
      {
         "Name": "Friend Guard",
         "Activation": "Cast",
         "Limit": "Daily",
         "Keyword": "None",
         "Effect": "For the rest of the encounter, any adjacent allied Pokemon who would be hit by any Moves that have a Damage Dice Roll of more than one die including STAB or extra effects, the enemy does not include STAB in their Damage Dice Roll."
      },
      {
         "Name": "Frisk",
         "Activation": "Cast",
         "Limit": "Hourly",
         "Keyword": "None",
         "Effect": "The adjacent target reveals what item they are holding, if any."
      },
      {
         "Name": "Gather",
         "Activation": "Cast",
         "Limit": "Weekly",
         "Keyword": "None",
         "Effect": "1d2 Unown appear. They are not immediately hostile."
      },
      {
         "Name": "Gluttony",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When given a consumable item, the Pokemon immediately eats it."
      },
      {
         "Name": "Guts",
         "Activation": "Trigger",
         "Limit": "Hourly",
         "Keyword": "None",
         "Effect": "When Burned, Poisoned, Paralyzed, Frozen or put to Sleep, the user's Attack is raised 2 Combat Stages. When a Pokemon loses the status, their Combat Stages are lowered what they raised."
      },
      {
         "Name": "Harvest",
         "Activation": "Trigger",
         "Limit": "At",
         "Keyword": "None",
         "Effect": "Whenever the user eats a Berry, flip a coin. On heads, the user produce another berry of the exact same variety as a held item available for use next turn. On tails nothing happens. When in Sunny Weather, Harvest will always activate successfully."
      },
      {
         "Name": "Haunt",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "Last Chance",
         "Effect": "Ghost"
      },
      {
         "Name": "Healer",
         "Activation": "Cast",
         "Limit": "Hourly",
         "Keyword": "None",
         "Effect": "One adjacent target suffering from at least one status affliction is instantly cured of all status afflictions."
      },
      {
         "Name": "Heat Proof",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The user halves the damage they would take from Fire Type Moves after they apply weakness and resistance."
      },
      {
         "Name": "Heavy Metal",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When referring to Weight Classes, treat the Pokemon as if it is 2 Weight Classes higher."
      },
      {
         "Name": "Honey Gather",
         "Activation": "Cast",
         "Limit": "Daily",
         "Keyword": "None",
         "Effect": "The user finds Honey if they are not holding an item."
      },
      {
         "Name": "Huge Power",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The Pokemon's base attack stat is doubled. This may double any bonuses from Nature or Vitamins, but not bonuses from Features."
      },
      {
         "Name": "Hustle",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The user's Attack is raised 1 Combat Stages. The user must roll +2 during Accuracy Checks to hit with attack that consult the Attack stat."
      },
      {
         "Name": "Hydration",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When in Rainy Weather, the user is healed of Paralysis, Burns, Poison, Freezing or Sleep."
      },
      {
         "Name": "Hyper Cutter",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The user's Attack Combat Stages may not be lowered."
      },
      {
         "Name": "Ice Body",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "While in Hailing Weather, the user gains 1/16 of their full HP at the beginning of each of their turns."
      },
      {
         "Name": "Illuminate",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "Moves that target the user must roll +2 to hit during Accuracy Check."
      },
      {
         "Name": "Illusion",
         "Activation": "Trigger",
         "Limit": "At",
         "Keyword": "None",
         "Effect": "Whenever you this Pokemon is sent out of its Poke Ball, you may choose another Pokemon that you have with you. The user now looks exactly like that Pokemon from your team until the user takes Damage as a result of a Move. This change is aesthetic and does not affect typing or Moves. You may dismiss Illusion whenever you want."
      },
      {
         "Name": "Immunity",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "Immune",
         "Effect": "Poisoning"
      },
      {
         "Name": "Imposter",
         "Activation": "Cast",
         "Limit": "Daily",
         "Keyword": "None",
         "Effect": "When Ditto is sent out, it may use the Move Transform as a free action. If the target of Transform has any modified Combat Stages, apply these Combat Stages to Ditto. One of the target's Abilities is randomly assigned to Ditto until Ditto uses Transform again."
      },
      {
         "Name": "Infiltrator",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The user ignores Walls and Hazards."
      },
      {
         "Name": "Inner Focus",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "Immune",
         "Effect": "Flinching"
      },
      {
         "Name": "Insomnia",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "Immune",
         "Effect": "Sleep"
      },
      {
         "Name": "Intimidate",
         "Activation": "Cast",
         "Limit": "Hourly",
         "Keyword": "None",
         "Effect": "Lower one target's Attack 1 Combat Stage."
      },
      {
         "Name": "Iron Barbs",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When hit by a Melee Ranged Move, the attacking foe loses 1/8 of their full HP. Do not apply weakness or resistance. Do not apply stats."
      },
      {
         "Name": "Iron Fist",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "Bullet Punch, Comet Punch, Dizzy Punch, Drain Punch, Dynamicpunch, Fire Punch, Meteor Mash, Shadow Punch, Sucker Punch, Ice Punch, Mega Punch, Sky Uppercut, Thunderpunch, Focus Punch, and Hammer Arm deal an additional 1 STAB when the Pokemon with Iron Fist uses the Move as an attack."
      },
      {
         "Name": "Justified",
         "Activation": "Trigger",
         "Limit": "At",
         "Keyword": "None",
         "Effect": "When hit by a damaging Dark Type Move, the user may raise its Attack 1 Combat Stage."
      },
      {
         "Name": "Keen Eye",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The Pokemon cannot have its Accuracy Checks negatively affected by anything except Defense, Special Defense or Speed stats."
      },
      {
         "Name": "Klutz",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The Pokemon with Klutz may drop held items, at-will, as a Free Action, even if they have Status Afflictions. The Pokemon may also hold an item, and ignore any effects the item has."
      },
      {
         "Name": "Landslide",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "Last Chance",
         "Effect": "Ground"
      },
      {
         "Name": "Last Chance",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "Last Chance",
         "Effect": "Normal"
      },
      {
         "Name": "Leaf Guard",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "While in Sunny Weather, the user is healed of Paralysis, Burns, Poison, Freezing or Sleep."
      },
      {
         "Name": "Levitate",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The Pokemon is immune to Ground Type Moves."
      },
      {
         "Name": "Light Metal",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When referring to Weight Classes, treat the Pokemon as if it is 2 Weight Classes lower."
      },
      {
         "Name": "Lightningrod",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "If any other Pokemon within 25-meters uses a Ranged Electric Type Move, the Move is drawn to the Pokemon with Lightning Rod without fail, and it cannot miss. This negates Lock-On or Mind Reader. This Pokemon is immune to damage and effects from Electric Moves, and each time they are hit by an Electric Move, the Pokemon's Special Attack is raised 1 Combat Stage."
      },
      {
         "Name": "Limber",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "Immune",
         "Effect": "Paralysis"
      },
      {
         "Name": "Liquid Ooze",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When the Pokemon with Liquid Ooze is damaged or looses life as a result of Absorb, Drain Punch, Giga Drain, Horn Leech, Leech Life, Leech Seed or Mega Drain, the Pokemon using one of the above Moves lose life instead of gaining life as described per Move. Do not apply weakness or resistance. Do not apply stats."
      },
      {
         "Name": "Mach Speed",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "Last Chance",
         "Effect": "Flying"
      },
      {
         "Name": "Magic Bounce",
         "Activation": "Trigger",
         "Limit": "Hourly",
         "Keyword": "None",
         "Effect": "When the user is hit by a Melee - No Damage or Ranged - No Damage Move, it may reflect the Move back to the offender. This Ability may be used to change the placement of any Hazards being set within 10 meters of the user as well."
      },
      {
         "Name": "Magic Guard",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "Whenever the user would lose HP or take damage that isn't a result of a Damage Dice Roll the user does not lose HP or take Damage. This includes, but is not limited to, Weather, Leech Seed, Afflictions, Traps, Recoil, etc."
      },
      {
         "Name": "Magma Armor",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "Immune",
         "Effect": "Freezing"
      },
      {
         "Name": "Magnet Pull",
         "Activation": "Cast",
         "Limit": "Hourly",
         "Keyword": "None",
         "Effect": "Target Steel Type pokemon may not move more then 20-meters away from the user, or target Steel Type pokemon may not move closer then 20-meters to the user."
      },
      {
         "Name": "Marvel Scale",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When Asleep, Paralyzed, Burned, Frozen or Poisoned, Marvel Scale raises the user's Special Defense 2 Combat Stages and raises the user's Defense 2 Combat Stages. The Combat Stages return to normal if the user is cured of their status affliction."
      },
      {
         "Name": "Mind Mold",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "Last Chance",
         "Effect": "Psychic"
      },
      {
         "Name": "Minus",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When an ally with the Ability Plus is within 10 meters, they are treated as if their Special Attack is raised 2 Combat Stages. The ally with Plus can only have one Minus Ability applied to its Special Attack."
      },
      {
         "Name": "Mold Breaker",
         "Activation": "Cast",
         "Limit": "Hourly",
         "Keyword": "None",
         "Effect": "The target's Ability is disabled, it cannot be used until the end of the encounter."
      },
      {
         "Name": "Moody",
         "Activation": "Cast",
         "Limit": "Required on first turn of an",
         "Keyword": "None",
         "Effect": "Encounter. Cast Moody again in 1d4+1 rounds. Roll 1d6; on 1, re-roll; on 2, raise the user's Attack 2 Combat Stages; on 3, raise the user's Defense 2 Combat Stages; on 4, raise the user's Special Attack 2 Combat Stages; on 5, raise the user's Special Defense 2 Combat Stages; on 6, raise the user's Speed 2 Combat Stages. Then roll 1d6; on 1, re-roll; on 2, lower the user's Attack 1 Combat Stages; on 3, lower the user's Defense 1 Combat Stages; on 4, lower the user's Special Attack 1 Combat Stages; on 5, lower the user's Special Defense 1 Combat Stages; on 6, lower the user's Speed 1 Combat Stages."
      },
      {
         "Name": "Motor Drive",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The pokemon is immune to damage and the effects of Electric Type Moves. Whenever an Electric Type Move hits the pokemon, raise their Speed 1 Combat Stage."
      },
      {
         "Name": "Mountain Peak",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "Last Chance",
         "Effect": "Rock"
      },
      {
         "Name": "Moxie",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "Whenever a user's Move causes a target to faint, it may raise its Attack Combat Stage by 1."
      },
      {
         "Name": "Multiscale",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When at full HP, when taking damage from a Move, half the total damage before applying weakness and resistance, before applying your Defenses."
      },
      {
         "Name": "Multitype",
         "Activation": "Cast",
         "Limit": "At Will",
         "Keyword": "None",
         "Effect": "Arceus changes its Elemental Type to any of the Elemental Types. Multitype cannot be copied or disabled."
      },
      {
         "Name": "Mummy",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "Whenever the user is a Legal Target of a Melee Range Move, the offender replaces all of its Abilities with Mummy for 1d6+2 rounds."
      },
      {
         "Name": "Natural Cure",
         "Activation": "Cast",
         "Limit": "Hourly",
         "Keyword": "None",
         "Effect": "The Pokemon is cured of Paralysis, Poisoning, Burns, Freezing and Sleep when returned to its Poke Ball."
      },
      {
         "Name": "No Guard",
         "Activation": "Cast",
         "Limit": "At Will",
         "Keyword": "None",
         "Effect": "Once used, No Guard is in effect until the end of the Encounter. All Moves you perform cannot miss and all Moves that target you cannot miss."
      },
      {
         "Name": "Normalize",
         "Activation": "Cast",
         "Limit": "At Will",
         "Keyword": "None",
         "Effect": "Once used, Normalize is in effect until the end of the Encounter. All Moves performed by the Pokemon are considered Normal Type instead of whatever Type they normally are."
      },
      {
         "Name": "Oblivious",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "Immune",
         "Effect": "Infatuation."
      },
      {
         "Name": "Overcharge",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "Last Chance",
         "Effect": "Electric"
      },
      {
         "Name": "Overcoat",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The user does not take damage from any Weather that would normally cause it to take damage."
      },
      {
         "Name": "Overgrow",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "Last Chance",
         "Effect": "Grass"
      },
      {
         "Name": "Own Tempo",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "Immune",
         "Effect": "Confusion"
      },
      {
         "Name": "Pickpocket",
         "Activation": "Trigger",
         "Limit": "Daily",
         "Keyword": "None",
         "Effect": "When the user hits an opponent that has a Held Item with a Melee Move, the user takes that item if it is not holding any."
      },
      {
         "Name": "Pickup",
         "Activation": "Cast",
         "Limit": "Daily",
         "Keyword": "Pickup",
         "Effect": "You may use Pickup at the end of any encounter. Roll 1d20, consult the Pickup keyword to figure out what you find."
      },
      {
         "Name": "Plus",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When an ally with the Ability Minus is within 10 meters, they are treated as if their Special Attack is raised 2 Combat Stages. The ally with Minus can only have one Plus Ability applied to its Special Attack."
      },
      {
         "Name": "Poison Heal",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When Poisoned or Badly Poisoned, the pokemon gains 1/8 of its full HP each turn instead of losing any HP. The pokemon does not have any Combat Stages lowered as a result of being Poisoned."
      },
      {
         "Name": "Poison Point",
         "Activation": "Trigger",
         "Limit": "Daily",
         "Keyword": "None",
         "Effect": "When hit by a melee Move, the Pokemon who attacked Poison Point's user is Poisoned."
      },
      {
         "Name": "Poison Touch",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The Pokemon's Moves which deal damage Poison Legal Targets on 19-20. If a move already has a chance of Poisoning foes, Poison Touch lowers the number needed to roll in order to Poison by -2."
      },
      {
         "Name": "Prankster",
         "Activation": "Cast",
         "Limit": "Daily",
         "Keyword": "None",
         "Effect": "For the remainder of the encounter, any Ranged - No Damage, Melee - No Damage, Self - No Damage or Field - No Damage Moves the user knows gain the keyword Interrupt. Prankster may not be used with Moves that set a Legal Target's HP to 0."
      },
      {
         "Name": "Pressure",
         "Activation": "Cast",
         "Limit": "Daily",
         "Keyword": "None",
         "Effect": "When this Ability is activated, all enemies have their Moves set to their original frequency if they were able to be used more frequently. In addition, At- Will moves are now EOT."
      },
      {
         "Name": "Pure Blooded",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "Last Chance",
         "Effect": "Dragon"
      },
      {
         "Name": "Pure Power",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The Pokemon's base Attack Stat is doubled. This may double any bonuses from Nature or Vitamins, but not bonuses from Features."
      },
      {
         "Name": "Quick Feet",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When Poisoned, Burned, Frozen or put to Sleep, the user's Speed is raised 2 Combat Stages. When Paralyzed, the user's Speed is raised 4 Combat Stages. When a Pokemon loses the status, their Combat Stages are lowered what they raised."
      },
      {
         "Name": "Rain Dish",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "While in Rainy Weather, the user gains 1/16 of their full HP at the beginning of each of their turns."
      },
      {
         "Name": "Rattled",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When hit by Bug, Dark, or Ghost Type Move, the user may raise its Speed 1 Combat Stage."
      },
      {
         "Name": "Reckless",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "Submission, Double-Edge, Take Down, Jump Kick, Hi Jump Kick, Volt Tackle, Wood Hammer, Flare Blitz, Brave Bird and Head Smash deal an additional 2 STAB when the Pokemon with Reckless uses the Move as an attack."
      },
      {
         "Name": "Regenerator",
         "Activation": "Cast",
         "Limit": "Hourly",
         "Keyword": "None",
         "Effect": "The user instantly heals 1/4th of its max HP."
      },
      {
         "Name": "Rivalry",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When battling a same gendered foe, the user may raise their Attack 2 Combat stages. Rivalry may only be only applied once per Encounter."
      },
      {
         "Name": "Rock Head",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When the Pokemon uses Volt Tackle, Wood Hammer, Submission, Take Down, Brave Bird, Double-Edge, Flare Blitz, Head Smash, Jump Kick or Hi Jump Kick they do not lose any HP as a result of the Move's effect."
      },
      {
         "Name": "Rough Skin",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When hit by a Melee Ranged Move, the attacking foe loses 1/8 of their full HP. Do not apply weakness or resistance. Do not apply stats."
      },
      {
         "Name": "Run Away",
         "Activation": "Cast",
         "Limit": "Daily",
         "Keyword": "None",
         "Effect": "The Pokemon escapes an encounter without fail. It can escape Traps. If Run Away's user can hold another Pokemon or their trainer, they are freed from the encounter as well."
      },
      {
         "Name": "Sand Force",
         "Activation": "Trigger",
         "Limit": "Daily",
         "Keyword": "None",
         "Effect": "While in Sandstorming Weather, the user may activate Sand Force until the end of an encounter. While active, Sand Force makes the user immune to damage from Sandstorms and the user deals an additional 2 STAB with Rock, Steel and Ground Moves regardless of the user's Type."
      },
      {
         "Name": "Sand Rush",
         "Activation": "Trigger",
         "Limit": "Daily",
         "Keyword": "None",
         "Effect": "While in Sandstorming Weather, the user may activate Sand Rush until the end of an encounter. While active, Sand Rush makes the user immune to damage from Sandstorms and its Speed stat is raised 4 Combat Stages. Do not add extra evasion to the user rasiing Combat Stages."
      },
      {
         "Name": "Sand Stream",
         "Activation": "Cast",
         "Limit": "Daily",
         "Keyword": "Sustain, Weather",
         "Effect": "As a Free Action, the Pokemon uses the Move Sandstorm. The Sandstorm does not go away like normal Sandstorm; instead to Sustain, the Pokemon must remain out of a Poke Ball and must be above 0 HP. The Sandstorming effect can be replaced by other major Weather conditions."
      },
      {
         "Name": "Sand Veil",
         "Activation": "Cast",
         "Limit": "Hourly",
         "Keyword": "Sustain",
         "Effect": "Sand Veil may only be activated while in Sandstorming Weather. The Pokemon creates a pocket of Clear Weather around itself and any other targets it wants to that is less then 15-meters away within the Sandstorm. These are Sand Bubbles. Any Move that tries to target into a Sand Bubble must roll +2 to hit during Accuracy Check. To Sustain, the Pokemon must remain out of a Poke Ball and must be above 0 HP."
      },
      {
         "Name": "Sap Sipper",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The user does not take damage from Grass Type Moves. If a Grass Type Move hits the user, the user may raise its Attack 1 Combat Stage up to once per turn."
      },
      {
         "Name": "Scrappy",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "Moves the Pokemon uses against Ghost Type foes can always hit them. Do not apply extra weaknesses or resistances. Do not apply Immunities. Count Moves those Ghost Type foes would usually be Immune to as Neutral Damaging Moves."
      },
      {
         "Name": "Serene Grace",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When a Move's effect has something that activates during Accuracy Check, but only if you roll high enough, all of those checks' requirements to activate are reduced by 3. This does not apply to Critical Hits."
      },
      {
         "Name": "Shadow Tag",
         "Activation": "Cast",
         "Limit": "Daily",
         "Keyword": "None",
         "Effect": "Once adjacent to the target, they are Trapped. They may still Shift, but cannot Shift more then 20-meters from Shadow Tag's user."
      },
      {
         "Name": "Shed Skin",
         "Activation": "Cast",
         "Limit": "Hourly",
         "Keyword": "None",
         "Effect": "The Pokemon is cured of Paralysis, Freezing, Burns, Poison, and Sleep."
      },
      {
         "Name": "Sheer Force",
         "Activation": "Cast",
         "Limit": "Daily",
         "Keyword": "None",
         "Effect": "Once used, Sheer Force is in effect until the end of the Encounter. Whenever you use a move that has a secondary effect, which activates during Accuracy Check, that effect is ignored. If an effect has been ignored, that attack now deals an additional 2 STAB."
      },
      {
         "Name": "Shell Armor",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "Immune",
         "Effect": "Critical Hits"
      },
      {
         "Name": "Shield Dust",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The effects of damage dealing Moves that target the Pokemon with Shield Dust are disabled."
      },
      {
         "Name": "Simple",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When the Pokemon's Combat Stages are altered, double the amount of Combat Stages they are raised or lowered."
      },
      {
         "Name": "Skill Link",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The Pokemon's Moves with the keyword Scatter can be used for their maximum amounts of time, even if one of the first attempts misses."
      },
      {
         "Name": "Slow Start",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "For 3 rounds, the Pokemon's Speed and Attack Stats are halved."
      },
      {
         "Name": "Sniper",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When the Pokemon gets a Critical Hit, add an additional Damage Dice Roll. This includes any base damage in the Damage Dice Roll."
      },
      {
         "Name": "Snow Cloak",
         "Activation": "Cast",
         "Limit": "Hourly",
         "Keyword": "Sustain",
         "Effect": "Snow Cloak may only be activated while in Hailing Weather. The Pokemon creates a pocket of Clear Weather around itself and any other targets it wants to that is less then 15-meters away within the Hail. These are Snow Bubbles. Any Move that tries to target into a Snow Bubble must roll +2 to hit during Accuracy Check. To Sustain, the Pokemon must remain out of a Poke Ball and must be above 0 HP."
      },
      {
         "Name": "Snow Warning",
         "Activation": "Cast",
         "Limit": "Hourly",
         "Keyword": "Sustain, Weather",
         "Effect": "As a Free Action, the Pokemon uses the Move Hail.The Hail does not go away like normal Hail; instead to Sustain, the pokemon must remain out of a Poke Ball and must be above 0 HP. The Hailing effect can be replaced by other major Weather conditions."
      },
      {
         "Name": "Solar Power",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "While in Sunny Weather, the Pokemon loses 1/8 of its full HP on its turn. When Sunny, its Special Attack Stat is increased by 2 Combat Stages."
      },
      {
         "Name": "Solid Rock",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "Super Effective Moves that target the Pokemon are only regularly effective and Super Super Effective Moves that target the Pokemon are only Super Effective."
      },
      {
         "Name": "Soundproof",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The Pokemon is immune to damage caused by and the effects of the Moves Bug Buzz, Chatter, Echoed Voice, Grasswhistle, Growl, Heal Bell, Hyper Voice, Metal Sound, Perish Song, Relic Song, Roar, Roar of Time, Screech, Sing, Snore, Supersonic and Uproar."
      },
      {
         "Name": "Speed Boost",
         "Activation": "Cast",
         "Limit": "Hourly",
         "Keyword": "None",
         "Effect": "The Pokemon's Speed is raised 1 Combat Stage on each of its turns."
      },
      {
         "Name": "Static",
         "Activation": "Trigger",
         "Limit": "Daily",
         "Keyword": "None",
         "Effect": "When a foe hits the Pokemon with Static with a melee Move, they become Paralyzed after damage is dealt."
      },
      {
         "Name": "Stall",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "In a round's queue, a Pokemon with Stall is always last. If a Pokemon goes to the end of the queue, the Pokemon with Stall is still the last to move."
      },
      {
         "Name": "Steadfast",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When Flinched, the Pokemon's Speed is raised 1 Combat Stage."
      },
      {
         "Name": "Stench",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The Pokemon's Moves which deal damage Flinch Legal Targets on 19-20. If a move already has a chance of Flinching foes, Stench lowers the number needed to roll in order to Flinch by -2."
      },
      {
         "Name": "Sticky Hold",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The Pokemon's held items cannot be stolen, switched, destroyed or dropped."
      },
      {
         "Name": "Storm Drain",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "If any other Pokemon within 25-meters uses a Ranged Water Type Move, the Move is drawn to the Pokemon with Storm Drain without fail, and it cannot miss. This negates Lock- On or Mind Reader. This Pokemon is immune to damage and effects from Water Moves, and each time they are hit by an Water Move, the Pokemon's Special Attack is raised 1 Combat Stage."
      },
      {
         "Name": "Sturdy",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The Pokemon is immune to the Moves Sheer Cold, Guillotine, Horn Drill and Fissure. If any attack would lower this Pokemon to 0 HP or less from full HP, instead the Pokemon's HP is set to 1."
      },
      {
         "Name": "Suction Cups",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The Pokemon is immune to the Moves Roar and Whirlwind. The Pokemon is immune to Push effects."
      },
      {
         "Name": "Super Luck",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The Pokemon's Moves are Critical Hits on 18-20. If a Move already has an extended Critical Hit range, Super Luck extends that range by -2."
      },
      {
         "Name": "Swarm",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "Last Chance",
         "Effect": "Bug"
      },
      {
         "Name": "Swift Swim",
         "Activation": "Trigger",
         "Limit": "Hourly",
         "Keyword": "None",
         "Effect": "While in Rainy Weather, the Speed stat of the Pokemon is raised 4 Combat Stages."
      },
      {
         "Name": "Synchronize",
         "Activation": "Trigger",
         "Limit": "Hourly",
         "Keyword": "None",
         "Effect": "When a foe Paralyzes, Freezes, Burns, Poisons, or puts the pokemon with Synchronize to Sleep, the foe is given the same Status effect they inflicted."
      },
      {
         "Name": "Tangled Feet",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "While Confused, the Pokemon's foes must roll +3 during Accuracy Check to hit the pokemon with Tangled Feet."
      },
      {
         "Name": "Technician",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "Moves with the Damage Dice Rolls whose Max Damage are less than 30 add an additional 2d10 to their Damage Dice Roll. Technician may only be applied once when used with a Move that has Scatter."
      },
      {
         "Name": "Telepathy",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "Whenever the Pokemon is a Legal Target, if the offender whose Move is hitting the Pokemon does not want the Pokemon to be considered a Legal Target; it is not."
      },
      {
         "Name": "Teravolt",
         "Activation": "Cast",
         "Limit": "Hourly",
         "Keyword": "None",
         "Effect": "The Target's Abilities are Disabled. They cannot be used until the end of the encounter."
      },
      {
         "Name": "Thick Fat",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The Pokemon is treated as if they are Resistant to Fire Type Moves and Ice Type Moves."
      },
      {
         "Name": "Tinted Lens",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The user's Resisted Moves instead deal Neutral Damage. The user's Doubly Resisted Moves are instead Resisted."
      },
      {
         "Name": "Torrent",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "Last Chance",
         "Effect": "Water"
      },
      {
         "Name": "Toxic Boost",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When Poisoned or Badly Poisoned, the user's Attack is raised by 2 Combat Stages. If the user is cured of its Poisoning, its Attack stat is lowered by 2 Combat Stages."
      },
      {
         "Name": "Trace",
         "Activation": "Cast",
         "Limit": "Hourly",
         "Keyword": "Sustain",
         "Effect": "The Pokemon gains the Ability of a target within 10-meters of the Pokemon with Trace. To sustain, the Pokemon must remain out of a Poke Ball and above 0 HP."
      },
      {
         "Name": "Truant",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "Roll 1d20 when a Pokemon with Truant tries to Shift and/or use a Move; on 1-8, the Pokemon does nothing; on 9-20, the Pokemon uses its turn normally."
      },
      {
         "Name": "Turboblaze",
         "Activation": "Cast",
         "Limit": "Hourly",
         "Keyword": "None",
         "Effect": "The Target's Abilities are Disabled. They cannot be used until the end of the encounter."
      },
      {
         "Name": "Unaware",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "When the pokemon is attacking or being attacked, it ignores all Combat Stages on the relevant target or attacker"
      },
      {
         "Name": "Unbreakable",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "Keywords: Last Chance",
         "Effect": "Steel"
      },
      {
         "Name": "Unburden",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "After consuming a held item, the Pokemon's Speed is raised 2 Combat Stages."
      },
      {
         "Name": "Unnerve",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "During battle, as long as you have a line of sight to a foe, that foe may not eat or drink anything. This includes berries, vitamins, or anything else that must be eaten to affect the foe."
      },
      {
         "Name": "Venom",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "Keywords: Last Chance",
         "Effect": "Poison"
      },
      {
         "Name": "Victory Star",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "Any allied Pokemon in the encounter will require -2 to hit during any Accuracy Check."
      },
      {
         "Name": "Vital Spirit",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "Keywords: Immune",
         "Effect": "Sleep"
      },
      {
         "Name": "Volt Absorb",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "After calculating damage that would be dealt from an Electric Type Move that hit the Pokemon, heal the Pokemon half of what it would have been dealt, instead of damaging the Pokemon. Do this before applying Defense but after applying weakness and resistance."
      },
      {
         "Name": "Water Absorb",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "After calculating damage that would be dealt from an Water Type Move that hit the Pokemon, heal the Pokemon half of what it would have been dealt instead of damaging the Pokemon. Do this before applying Defense but after applying weakness and resistance."
      },
      {
         "Name": "Water Veil",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "Keywords: Immune",
         "Effect": "Burns"
      },
      {
         "Name": "Weak Armor",
         "Activation": "Trigger",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "Whenever the user is hit by an attack that consults the user's Defense stat, the user may lower its Defense Combat Stage one level in order to raise its Speed Combat Stage one level."
      },
      {
         "Name": "White Smoke",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "The user's Combat Stages may not be lowered."
      },
      {
         "Name": "Wonder Guard",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "Only damaging Moves that are Super-Effective hit the Pokemon with Wonder Guard, all other moves always deal 0 damage. Wonder Guard does not work if the Pokemon who has it has no weaknesses. Only Shedinja and Arceus may ever have the ability Wonder Guard. Wonder Guard loses its effect if the user has no weaknesses."
      },
      {
         "Name": "Wonder Skin",
         "Activation": "Static",
         "Limit": "None",
         "Keyword": "None",
         "Effect": "Whenever a Ranged - No Damage or Melee - No Damage move that causes Paralysis, Poisoning, Bad Poisoning, a Burn, Sleep, Confusion, Attraction, Disable, or any other major or minor status affliction is used against this Pokemon and the Move successfully hits, flip a coin. On heads, this Pokemon ignores the affliction it would have received; on tails the Pokemon is hit as usual."
      },
      {
         "Name": "Zen Mode",
         "Activation": "Cast",
         "Limit": "At",
         "Keyword": "None",
         "Effect": "Keep two sets of Base Stats for Darmanitan, the first set of Base Stats are its normal stats while the second will be referred to during Zen Mode. The HP Stat for both sets of Base Stats must be the same. If Darmanitan has its Base Stats altered in any way, both sets of Base Stats are affected. As a free action, Darmanitan may activate Zen Mode if it is at less than 50% of its full HP. Darmanitan may change back from Zen Mode as a free action. Darmanitan may switch from one form to another once per encounter."
      }
   ]
}